# Треугольник существует только тогда, когда сумма любых двух его сторон больше третьей. Дано a, b, c — 
# стороны предполагаемого треугольника. Требуется сравнить длину каждого отрезка-стороны с суммой 
# двух других. Если хотя бы в одном случае отрезок окажется больше суммы двух других, то треугольника 
# с такими сторонами не существует. Отдельно сообщить является ли треугольник разносторонним, 
# равнобедренным или равносторонним.

a = 2
b = 2
c = 2

if (a + b) > c and (b + c) > a and (a + c) > b:
    print('Треугольник с такими сторонами существует')
    if a == b == c:
        print('Треугольник равносторонний')
    elif a == b or b == c or a == c:
        print('Треугольник равнобедренный')
else:
    print('Треугольника с такими сторонами НЕ существует')
