# Задание 1.
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

a = 1
b = 0.1
c = "hello"
print(type(a))
print(type(b))
print(type(c))
