# Задание №2
# Создайте в переменной data список значений разных типов перечислив их через
# запятую внутри квадратных скобок. Для каждого элемента в цикле выведите:
# ✔ порядковый номер начиная с единицы
# ✔ значение
# ✔ адрес в памяти
# ✔ размер в памяти
# ✔ хэш объекта
# ✔ результат проверки на целое число только если он положительный
# ✔ результат проверки на строку только если он положительный
# Добавьте в список повторяющиеся элементы и сравните на результаты.

data = [1, 0.1, 'hello', 1, 'hello']

for i, item in enumerate(data, start=1):
    print(i, item, id(i), item.__sizeof__(), hash(item),
          'целое' if isinstance(item, int) else '',
          'строка' if isinstance(item, str) else '')
